Ran Plan for dir: `terraform/ap-southeast-1` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.5.3 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/vntechies/013-demo-gitops/8/default/terraform/ap-southeast-1/vntechies-gitops-default.tfplan\"" in "/home/atlantis/.atlantis/repos/vntechies/013-demo-gitops/8/default/terraform/ap-southeast-1": exit status 1
module.vpc["demo-vpc"].data.aws_region.current: Reading...
module.eks.aws_iam_role.cluster: Refreshing state... [id=eks-cluster-thodung-vntechies-demo-eks]
module.vpc["demo-vpc"].data.aws_region.current: Read complete after 0s [id=ap-southeast-1]
module.eks.data.aws_region.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.vpc["demo-vpc"].aws_vpc.vpc: Refreshing state... [id=vpc-05f67dec3e19597d3]
module.eks.aws_iam_policy.ebs_csi["aws-ebs-csi-driver"]: Refreshing state... [id=arn:aws:iam::010352592457:policy/thodung-vntechies-demo-eks-ebs-csi]
module.eks.aws_iam_role.node: Refreshing state... [id=eks-node-group-thodung-vntechies-demo-eks]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_region.current: Read complete after 0s [id=ap-southeast-1]
module.vpc["demo-vpc"].aws_subnet.this["public_subnet2"]: Refreshing state... [id=subnet-01183ba54fce29ae7]
module.vpc["demo-vpc"].aws_route_table.this["public_rtb"]: Refreshing state... [id=rtb-01d240c02fb6f1f20]
module.vpc["demo-vpc"].aws_subnet.this["public_subnet3"]: Refreshing state... [id=subnet-0b1743b318f3693ee]
module.vpc["demo-vpc"].aws_security_group.endpoint: Refreshing state... [id=sg-0618aee9155004a34]
module.vpc["demo-vpc"].aws_subnet.this["public_subnet1"]: Refreshing state... [id=subnet-0cb7fc68240103b1b]
module.vpc["demo-vpc"].aws_internet_gateway.igw[0]: Refreshing state... [id=igw-0d474349bd636d68c]
module.vpc["demo-vpc"].aws_vpc_endpoint.s3: Refreshing state... [id=vpce-05ecb02e9d23abbee]
module.vpc["demo-vpc"].aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01d240c02fb6f1f201080289494]
module.vpc["demo-vpc"].aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-0c819eb8e77498f45]
module.vpc["demo-vpc"].aws_route_table_association.this["public_subnet1"]: Refreshing state... [id=rtbassoc-0f53fe4cb204ed857]
module.vpc["demo-vpc"].aws_route_table_association.this["public_subnet2"]: Refreshing state... [id=rtbassoc-0e94b60fd41ea6f9e]
module.vpc["demo-vpc"].aws_route_table_association.this["public_subnet3"]: Refreshing state... [id=rtbassoc-0585bda2a9df2c9e0]
data.aws_subnets.eks_vpc_subnets: Reading...
module.eks.data.aws_caller_identity.current: Read complete after 1s [id=010352592457]
data.aws_subnets.eks_vpc_subnets: Read complete after 1s [id=ap-southeast-1]
module.eks.aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=eks-node-group-thodung-vntechies-demo-eks-20230714145948148500000005]
module.eks.aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=eks-node-group-thodung-vntechies-demo-eks-20230714145947876100000002]
module.eks.aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=eks-node-group-thodung-vntechies-demo-eks-20230714145947886900000003]
module.eks.aws_iam_role_policy_attachment.AmazonSSMManagedInstanceCore: Refreshing state... [id=eks-node-group-thodung-vntechies-demo-eks-20230714145947863900000001]
module.eks.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=eks-cluster-thodung-vntechies-demo-eks-20230714145948144200000004]
module.eks.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=eks-cluster-thodung-vntechies-demo-eks-20230714145948151000000006]
module.eks.aws_eks_cluster.eks: Refreshing state... [id=thodung-vntechies-eks-demo-eks]
module.eks.data.tls_certificate.this: Reading...
data.aws_eks_cluster_auth.eks: Reading...
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.eks.data.aws_eks_addon_version.this["cni"]: Reading...
data.aws_eks_cluster_auth.eks: Read complete after 0s [id=thodung-vntechies-eks-demo-eks]
module.eks.data.tls_certificate.this: Read complete after 0s [id=5f0630e8a1c4ee9bd3e7e715837e311bdbd1cd3d]
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 0s [id=aws-ebs-csi-driver]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::010352592457:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/1E420E5E377EF7A7868356CCBB541B6D]
module.eks.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.aws_eks_node_group.node["workers-1-23"]: Refreshing state... [id=thodung-vntechies-eks-demo-eks:workers-1-23]
module.eks.data.aws_eks_addon_version.this["cni"]: Read complete after 0s [id=vpc-cni]
module.eks.aws_iam_role.irsa["aws-ebs-csi-driver"]: Refreshing state... [id=aws-ebs-csi-driver]
module.eks.aws_eks_addon.this["cni"]: Refreshing state... [id=thodung-vntechies-eks-demo-eks:vpc-cni]
module.eks.aws_iam_role_policy_attachment.irsa_ebs_csi_policy["aws-ebs-csi-driver"]: Refreshing state... [id=aws-ebs-csi-driver-2023071415072141720000000a]
module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=thodung-vntechies-eks-demo-eks:aws-ebs-csi-driver]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_eks_cluster.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "eks" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "thodung-vntechies-eks-demo-eks"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_route_table_association.this["public_subnet4"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = "rtb-01d240c02fb6f1f20"
      + subnet_id      = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_subnet.this["public_subnet4"] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "thodung-vntechies-public_subnet4-ap-southeast-1c"
          + "group"                  = "public_subnet"
          + "kubernetes.io/role/elb" = "1"
          + "public_subnet3"         = "ap-southeast-1c"
        }
      + tags_all                                       = {
          + "Name"                   = "thodung-vntechies-public_subnet4-ap-southeast-1c"
          + "component"              = "thodung"
          + "env"                    = "vntechies"
          + "github_repo"            = "github.com/vntechies/013-demo-gitops"
          + "group"                  = "public_subnet"
          + "kubernetes.io/role/elb" = "1"
          + "project"                = "013-demo-gitops"
          + "public_subnet3"         = "ap-southeast-1c"
        }
      + vpc_id                                         = "vpc-05f67dec3e19597d3"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ subnet_ids                          = {
      ~ demo-vpc = {
          + public_subnet4 = (known after apply)
            # (3 unchanged attributes hidden)
        }
    }
╷
│ Error: Get "http://localhost/api/v1/namespaces/kube-system/configmaps/aws-auth": dial tcp 127.0.0.1:80: connect: connection refused
│ 
│   with module.eks.kubernetes_config_map_v1_data.aws_auth[0],
│   on .terraform/modules/eks/main.tf line 76, in resource "kubernetes_config_map_v1_data" "aws_auth":
│   76: resource "kubernetes_config_map_v1_data" "aws_auth" {
│ 
╵

```
</details>